package days02;

public class Ex05_09 {

	public static void main(String[] args) {
			//[실수표현]
			//1) 실수 3.14 -> 2진수 표현 (변경) -> float [][][][] x 4 (4비트)
			// *문자는 정해진 코드가 있어서 괜찮지만 2진수는 실수가 있어야 함으로 변경일 필요*
			// 실수는 double 이어도 오차가 있다.
			// [예]
		/*
		 * 		-> 2진수 표현(2진법 변환)
		 * 	0.625	-> 0.101(2)
		 * 	0.625 x 2 =  [1].25 
		 *  0.25 x 2 = [0].5
		 *  0.5 x 2 = [1].0
		 *  
		 *  0.101(2) -> 10진수 실수 변환
		 *  	2^-1+ 2^-3 + 2^-3
		 *  
		 *  [예] (float,double)로 해도 오차가 생긴다
		 *  0.123456 유한실수
		 *  0.01011101010101101010101101010101111100010		
		 *  
		 *  [예] 9.123456 실수 -> 2진수 실수 변환 -> float(4) / double(8)
		 *  		  
		 */
			
		
		
		
		
	}

}
